** Others
#+BEGIN_SRC shell :results scalar
python manage.py routes
#+END_SRC

#+RESULTS:
#+begin_example
_debug_toolbar.static                              HEAD,OPTIONS,GET     /_debug_toolbar/static/[filename]
auth.login                                         HEAD,POST,OPTIONS,GET /auth/
debugtoolbar.save_template                         POST,OPTIONS         /_debug_toolbar/views/template/[key]/save
debugtoolbar.sql_select                            HEAD,POST,OPTIONS,GET /_debug_toolbar/views/sqlalchemy/sql_explain
debugtoolbar.sql_select                            HEAD,POST,OPTIONS,GET /_debug_toolbar/views/sqlalchemy/sql_select?explain=[explain]
debugtoolbar.template_editor                       HEAD,OPTIONS,GET     /_debug_toolbar/views/template/[key]
debugtoolbar.template_preview                      POST,OPTIONS         /_debug_toolbar/views/template/[key]
main.index                                         HEAD,OPTIONS,GET     /
manager.index                                      HEAD,OPTIONS,GET     /manager/
static                                             HEAD,OPTIONS,GET     /static/[filename]
#+end_example



Command.query.filter(Command.status.in_([Command.DELIVERED, Command.NEVER_DELIVERED]), recieved=)
